app/controllers/postings_controller.rb

  def all
    @postings = Posting.all
---
SELECT "postings".* FROM "postings"

  def create
    coords = Geocoder.coordinates(params[:address])
    @posting = Posting.new(
      name: params[:name],
      contact: params[:contact],
      latitude: coords[0],
      longitude: coords[1],
      categories: params[:categories],
      number_of_people: params[:number_of_people]
    )

    if @posting.save
---
INSERT INTO "postings" ("name", "contact", "latitude", "longitude", "categories", "number_of_people", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def delete
    Posting.find(params[:id]).destroy!
---
DELETE FROM "postings" WHERE "postings"."id" = $1  [["id", 14]]
SELECT  "postings".* FROM "postings" WHERE "postings"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]